TrainBackend/app/controllers/trains_controller.rb

SELECT `trains`.* FROM `trains` WHERE (departureTime >= '2023-08-09 11:00:20.920955' AND departureTime <= '2023-08-09 22:30:20.920993') ORDER BY `trains`.`priceSleeper` ASC, `trains`.`priceAC` ASC, `trains`.`seatsAvailablesleeper` DESC, `trains`.`seatsAvailableAC` DESC, `trains`.`departureTime` DESC
---
  def index
    trains = Train.where("departureTime >= ? AND departureTime <= ?", Time.now + 30.minutes, Time.now + 12.hours).order(priceSleeper: :asc, priceAC: :asc, seatsAvailablesleeper: :desc, seatsAvailableAC: :desc, departureTime: :desc)
    formatted_trains = trains.map do |train|

SELECT `trains`.* FROM `trains` WHERE `trains`.`trainNumber` = '2344' LIMIT 1
---
  def trainDetails
    train = Train.find_by(trainNumber: params[:trainNumber])

INSERT INTO `trains` (`trainName`, `trainNumber`, `departureTime`, `seatsAvailablesleeper`, `seatsAvailableAC`, `priceSleeper`, `priceAC`, `delayedBy`, `created_at`, `updated_at`) VALUES ('Chennai Exp', '2344', NULL, 3, 2, 1000, 5000, 15, '2023-08-09 10:12:41.371761', '2023-08-09 10:12:41.371761')
---
  def create
    @train = Train.new(train_params)
    # @train.departureTime = Time.new(2020, 8, train_params[:departureTime][:Day], train_params[:departureTime][:Hours], train_params[:departureTime][:Minutes], train_params[:departureTime][:Seconds])

    if @train.save

SELECT `trains`.* FROM `trains` WHERE `trains`.`id` = NULL LIMIT 1
---
    def set_train
      @train = Train.find(params[:id])